const title = '「気分e名言」利用規約';

const promptText =
    '本規約は、お客様が、RINGRIN（以下「当方」）が提供する「気分e名言」アプリ（以下「本アプリ」）をご利用頂く際の取扱いにつき定めるものです。お客様が本アプリを利用する場合は、本規約を遵守するものとします。また本アプリの中で表示される各種注意書きも、本規約の一部を構成するものとします。';

const termTitle1 = '第1条（定義）';
const termDescription1 = '''
本規約上で使用する用語の定義は、次に掲げるとおりとします。
·本アプリ：Apple Inc. または iTunes 株式会社が運営する「App Store」および Google Inc.が運営する「Google Play」上で配布されるスマートフォン向けアプリケーション「気分e名言」（理由の如何を問わずサービスの名称または内容が変更された場合は、当該変更後のアプリケーションを含む。）
·当方ウェブサイト：当方が運営するウェブサイト（https://ringrin.jp/）、または当方が今後運営する可能性のある本アプリに係るウェブサイト
''';

const termTitle2 = '第２条（本規約への同意)';
const termDescription2 = '''
１　利用者は、本利用規約に同意頂いた上で、本アプリを利用できるものとします。
２　利用者が、本アプリをスマートフォンその他の情報端末にダウンロードし、本規約への同意手続を行った時点で、利用者と当方との間で、本規約の諸規定に従った利用契約が成立するものとします。
３　利用者が未成年者である場合には、親権者その他の法定代理人の同意を得たうえで、本アプリをご利用ください。
４　未成年者の利用者が、法定代理人の同意がないにもかかわらず同意があると偽りまたは年齢について成年と偽って本アプリを利用した場合、その他行為能力者であることを信じさせるために詐術を用いた場合、本アプリに関する一切の法律行為を取り消すことは出来ません。
５ 本規約の同意時に未成年であった利用者が成年に達した後に本アプリを利用した場合、当該利用者は本アプリに関する一切の法律行為を追認したものとみなされます。
''';

const termTitle3 = '第３条（規約の変更）';
const termDescription3 = '''
１　当方は、利用者の承諾を得ることなく、いつでも、本規約の内容を改定することができるものとし、利用者はこれを異議なく承諾するものとします。
２　当方は、本規約を改定するときは、その内容について当方所定の方法により利用者に通知します。
３　前本規約の改定の効力は、当方が前項により通知を行った時点から生じるものとします。
４　利用者は、本規約変更後、本アプリを利用した時点で、変更後の本利用規約に異議なく同意したものとみなされます。
''';

const termTitle4 = '第４条（利用手続）';
const termDescription4 = '''
１　本アプリの利用を希望する方（以下「登録希望者」）は、本規約に同意した上で、所定の方法で利用の申込を行ってください。
２　利用の申込をした方は、当方がその申込を承諾した時点から登録ユーザとなります。
３　当方は、登録ユーザ向けにメールで連絡事項の告知や広告その他の情報提供を行うことがあります。あらかじめご了承ください。
４　当方は、登録希望者が次の各号のいずれか一つに該当する場合は、当方の判断により利用申込を承諾しないことがあります。
・　登録希望者が、当方の定める方法によらず利用の申込を行った場合
・　登録希望者が、過去に本規約または当方の定めるその他の利用規約等に違反したことを理由として退会処分を受けた者である場合
・　登録希望者が、不正な手段をもって利用していると当方が判断した場合
・　登録希望者が、本人以外の情報を登録している場合
・　その他当方が不適切と判断した場合
''';

const termTitle5 = '第５条（アカウントの管理）';
const termDescription5 = '''
１　利用者は、利用に際して登録した情報（以下、「登録情報」といいます。）について、自己の責任の下、任意に登録、管理するものとします。利用者は、これを第三者に利用させ、または貸与、譲渡、名義変更、売買などをしてはならないものとします。
２　当方は、登録情報によって本アプリの利用があった場合、利用登録をおこなった本人が利用したものと扱うことができ、当該利用によって生じた結果ならびにそれに伴う一切の責任については、利用登録を行った本人に帰属するものとします。
３　利用者は、登録情報の不正使用によって当方または第三者に損害が生じた場合、当方および第三者に対して、当該損害を賠償するものとします。
４　登録情報の管理は、利用者が自己の責任の下で行うものとし、登録情報が不正確または虚偽であったために利用者が被った一切の不利益および損害に関して、当方は責任を負わないものとします。
５　登録情報が盗用されまたは第三者に利用されていることが判明した場合、利用者は直ちにその旨を当方に通知するとともに、当方からの指示に従うものとします。
''';

const termTitle6 = '第６条（個人情報等の取り扱い）';
const termDescription6 =
    '''個人情報及び利用者情報については、当方が別途定める「RINGRINプライバシーポリシー」に則り、適正に取り扱うこととします。
''';

const termTitle7 = '第７条（禁止行為）';
const termDescription7 = '''
本アプリの利用に際し、当方は、利用者に対し、次に掲げる行為を禁止します。当方において、利用者が禁止事項に違反したと認めた場合、利用者用の一時停止、退会処分その他当方が必要と判断した措置を取ることができます。
１　当方または第三者の知的財産権を侵害する行為
２　当方または第三者の名誉・信用を毀損または不当に差別もしくは誹謗中傷する行為
３　当方または第三者の財産を侵害する行為、または侵害する恐れのある行為
４　当方または第三者に経済的損害を与える行為
５　当方または第三者に対する脅迫的な行為
６　コンピューターウィルス、有害なプログラムを仕様またはそれを誘発する行為
７　本アプリ用インフラ設備に対して過度な負担となるストレスをかける行為
８　本アプリ、当方ウェブサイトのサーバーやシステム、セキュリティへの攻撃
９　当方提供のインターフェース以外の方法で当方アプリにアクセスを試みる行為
１０　本アプリの逆アセンブル、逆コンパイル、リバースエンジニアリング、その他本アプリのソースコード、構造、アイデア等を解析する行為
本アプリの複製、改変、翻案または他のソフトウェアと結合等する行為
１１　本アプリに組み込まれているセキュリティデバイスまたはセキュリティコードを破壊する行為
本アプリを第三者に送信可能な状態でネットワーク上に蓄積する行為、また本アプリを第三者に送信する行為
本アプリまたは本アプリに付されている著作権表示およびその他の権利表示を除去または変更する行為
１２　本アプリおよび本規約に基づく本アプリの使用権の第三者に再許諾、譲渡、移転等の処分
１３　本アプリの譲渡、転売、貸与・レンタルに類する行為、または中古取引
１４　当方がお客様に提供する本アプリの識別情報（シリアルナンバー等）の第三者への開示・提供
１５　上記の他、当方が不適切と判断する行為
''';

const termTitle8 = '第８条（免責）';
const termDescription8 = '''
１　当方は、本アプリの内容変更、中断、終了によって生じたいかなる損害についても、一切責任を負いません。
２　当方は、利用者の本アプリの利用環境について一切関与せず、また一切の責任を負いません。
３　当方は、本アプリが利用者の特定の目的に適合すること、期待する機能・商品的価値・正確性・有用性を有すること、利用者による本アプリの利用が利用者に適用のある法令または業界団体の内部規則等に適合すること、および不具合が生じないことについて、何ら保証するものではありません。
４　当方は、本アプリが全ての情報端末に対応していることを保証するものではなく、本アプリの利用に供する情報端末のＯＳのバージョンアップ等に伴い、本アプリの動作に不具合が生じる可能性があることを、利用者はあらかじめ了承するものとします。当方は、かかる不具合が生じた場合に当方が行うプログラムの修正等により、当該不具合が解消されることを保証するものではありません。
５　利用者は、AppStore、GooglePlay等のアプリストアの利用規約および運用方針の変更等に伴い、本アプリの一部又は全部の利用が制限される可能性があることをあらかじめ了承するものとします。
６　当方は、本アプリを利用したことにより直接的または間接的に利用者に発生した損害について、一切賠償責任を負いません。
７　当方は、利用者その他の第三者に発生した機会逸失、業務の中断その他いかなる損害（間接損害や逸失利益を含みます）に対して、当方が係る損害の可能性を事前に通知されていたとしても、一切の責任を負いません。
８　利用者と他の利用者との間の紛争及びトラブルについて、当方は一切責任を負わないものとします。利用者と他の利用者でトラブルになった場合でも、両者同士の責任で解決するものとし、当方には一切の請求をしないものとします。
９　利用者は、本アプリの利用に関連し、他の利用者に損害を与えた場合または第三者との間に紛争を生じた場合、自己の費用と責任において、かかる損害を賠償またはかかる紛争を解決するものとし、当方には一切の迷惑や損害を与えないものとします。
１０　利用者の行為により、第三者から当方が損害賠償等の請求をされた場合には、利用者の費用（弁護士費用）と責任で、これを解決するものとします。当方が、当該第三者に対して、損害賠償金を支払った場合には、利用者は、当方に対して当該損害賠償金を含む一切の費用（弁護士費用及び逸失利益を含む）を支払うものとします。
１１　利用者が本アプリの利用に関連して当方に損害を与えた場合、利用者の費用と責任において当方に対して損害を賠償（訴訟費用及び弁護士費用を含む）するものとします。
''';

const termTitle9 = '第９条(本アプリの廃止)';
const termDescription9 = '''
当方は、当方の事情による設備の保守、管理上やむを得ぬ事由がある場合、お客様に告知したうえで本サービスの提供を停止することができるものとします。
''';

const termTitle10 = '第１０条（広告の掲載について）';
const termDescription10 =
    '利用者は、本アプリ上にあらゆる広告が含まれる場合があること、当方またはその提携先があらゆる広告を掲載する場合があることを理解しこれを承諾したものとみなします。本アプリ上の広告の形態や範囲は、当方によって随時変更されます。';

const termTitle11 = '第１１条（有料サービス等）';
const termDescription11 = '''
１．本アプリは基本機能については無料で利用することが出来ますが、有料サービス等を利用する場合、お客様は、当方の指定する登録手続をする必要があります。当該登録手続の完了時に、お客様と当方との間に有料サービスに関する契約（以下「有料サービス契約」といいます。）が成立します。 
２．有料サービス契約をしたお客様は、当方に対し、当方の指定する方法で有料サービスの利用料（以下「利用料」といいます。）を支払うものとします。利用料は、別途本アプリ又は当方ウェブサイトに記載する通りとします。 
３．本サービスの利用には、電気通信事業者の定めるところに従い、別途通信料等が発生する場合があります。通信料等は、お客様が負担するものとします。 
４．当方は、お客様から支払われた利用料の返還はいたしません。 
５．利用者は、自己の責任により購入代金の決済を行うものとし、当該決済において利用者に不利益および損害が発生した場合においても、当方は責任を負わないものとします。 
６．当方は、利用者から事前の承諾を得ることなく、購入代金を変更することができるものとします。 
７．購入代金の変更は、変更後の利用料金が本アプリまたは当方ウェブサイト内に表示された時点より効力が生じるものとする。
''';

const termTitle12 = '第１２条（権利譲渡の禁止）';
const termDescription12 = '''
１　利用者は、予め当方の書面による承諾がない限り、本規約上の地位および本規約に基づく権利または義務の全部または一部を第三者に譲渡してはならないものとします。
２　当方は、本アプリの全部または一部を当方の裁量により第三者に譲渡することができ、その場合、譲渡された権利の範囲内で利用者のアカウントを含む、本アプリに係る利用者の一切の権利が譲渡先に移転するものとします。
''';

const termTitle13 = '第１３条（分離可能性）';
const termDescription13 = '''
本規約のいずれかの条項又はその一部が、消費者契約法その他の法令等により無効又は執行不能と判断された場合であっても、本規約の残りの規定及び一部が無効又は執行不能と判断された規定の残りの部分は、継続して完全に効力を有するものとします。
''';

const termTitle14 = '第１４条（当方への連絡方法））';
const termDescription14 =
    '本アプリに関する利用者の当方へのご連絡·お問い合わせは、本アプリまたは当方ウェブサイト内の適宜の場所に設置するお問い合わせフォームからの送信または当方が別途指定する方法により行うものとします。';

const enforcementDateText = '2023年9月10日制定';
